espressif/esp-idf/components/soc/soc/esp32s3/include/soc/gpio_reg.h
#define GPIO_FUNC46_OUT_SEL_CFG_REG          (DR_REG_GPIO_BASE + 0x60C)
/* GPIO_FUNC46_OEN_INV_SEL : R/W ;bitpos:[11] ;default: 1'h0 ; */
/*description: */
#define GPIO_FUNC46_OEN_INV_SEL  (BIT(11))
#define GPIO_FUNC46_OEN_INV_SEL_M  (BIT(11))
#define GPIO_FUNC46_OEN_INV_SEL_V  0x1
#define GPIO_FUNC46_OEN_INV_SEL_S  11
/* GPIO_FUNC46_OEN_SEL : R/W ;bitpos:[10] ;default: 1'h0 ; */
/*description: */
#define GPIO_FUNC46_OEN_SEL  (BIT(10))
#define GPIO_FUNC46_OEN_SEL_M  (BIT(10))
#define GPIO_FUNC46_OEN_SEL_V  0x1
#define GPIO_FUNC46_OEN_SEL_S  10
/* GPIO_FUNC46_OUT_INV_SEL : R/W ;bitpos:[9] ;default: 1'h0 ; */
/*description: */
#define GPIO_FUNC46_OUT_INV_SEL  (BIT(9))
#define GPIO_FUNC46_OUT_INV_SEL_M  (BIT(9))
#define GPIO_FUNC46_OUT_INV_SEL_V  0x1
#define GPIO_FUNC46_OUT_INV_SEL_S  9
/* GPIO_FUNC46_OUT_SEL : R/W ;bitpos:[8:0] ;default: 9'h100 ; */
/*description: */
#define GPIO_FUNC46_OUT_SEL  0x000001FF
#define GPIO_FUNC46_OUT_SEL_M  ((GPIO_FUNC46_OUT_SEL_V)<<(GPIO_FUNC46_OUT_SEL_S))
#define GPIO_FUNC46_OUT_SEL_V  0x1FF
#define GPIO_FUNC46_OUT_SEL_S  0

#define GPIO_FUNC47_OUT_SEL_CFG_REG          (DR_REG_GPIO_BASE + 0x610)
/* GPIO_FUNC47_OEN_INV_SEL : R/W ;bitpos:[11] ;default: 1'h0 ; */
/*description: */
#define GPIO_FUNC47_OEN_INV_SEL  (BIT(11))
#define GPIO_FUNC47_OEN_INV_SEL_M  (BIT(11))
#define GPIO_FUNC47_OEN_INV_SEL_V  0x1
#define GPIO_FUNC47_OEN_INV_SEL_S  11
/* GPIO_FUNC47_OEN_SEL : R/W ;bitpos:[10] ;default: 1'h0 ; */
/*description: */
#define GPIO_FUNC47_OEN_SEL  (BIT(10))
#define GPIO_FUNC47_OEN_SEL_M  (BIT(10))
#define GPIO_FUNC47_OEN_SEL_V  0x1
#define GPIO_FUNC47_OEN_SEL_S  10
/* GPIO_FUNC47_OUT_INV_SEL : R/W ;bitpos:[9] ;default: 1'h0 ; */
/*description: */
#define GPIO_FUNC47_OUT_INV_SEL  (BIT(9))
#define GPIO_FUNC47_OUT_INV_SEL_M  (BIT(9))
#define GPIO_FUNC47_OUT_INV_SEL_V  0x1
#define GPIO_FUNC47_OUT_INV_SEL_S  9
/* GPIO_FUNC47_OUT_SEL : R/W ;bitpos:[8:0] ;default: 9'h100 ; */
/*description: */
#define GPIO_FUNC47_OUT_SEL  0x000001FF
#define GPIO_FUNC47_OUT_SEL_M  ((GPIO_FUNC47_OUT_SEL_V)<<(GPIO_FUNC47_OUT_SEL_S))
#define GPIO_FUNC47_OUT_SEL_V  0x1FF
#define GPIO_FUNC47_OUT_SEL_S  0

#define GPIO_FUNC48_OUT_SEL_CFG_REG          (DR_REG_GPIO_BASE + 0x614)
/* GPIO_FUNC48_OEN_INV_SEL : R/W ;bitpos:[11] ;default: 1'h0 ; */
/*description: */
#define GPIO_FUNC48_OEN_INV_SEL  (BIT(11))
#define GPIO_FUNC48_OEN_INV_SEL_M  (BIT(11))
#define GPIO_FUNC48_OEN_INV_SEL_V  0x1
#define GPIO_FUNC48_OEN_INV_SEL_S  11
/* GPIO_FUNC48_OEN_SEL : R/W ;bitpos:[10] ;default: 1'h0 ; */
/*description: */
#define GPIO_FUNC48_OEN_SEL  (BIT(10))
#define GPIO_FUNC48_OEN_SEL_M  (BIT(10))
#define GPIO_FUNC48_OEN_SEL_V  0x1
#define GPIO_FUNC48_OEN_SEL_S  10
/* GPIO_FUNC48_OUT_INV_SEL : R/W ;bitpos:[9] ;default: 1'h0 ; */
/*description: */
#define GPIO_FUNC48_OUT_INV_SEL  (BIT(9))
#define GPIO_FUNC48_OUT_INV_SEL_M  (BIT(9))
#define GPIO_FUNC48_OUT_INV_SEL_V  0x1
#define GPIO_FUNC48_OUT_INV_SEL_S  9
/* GPIO_FUNC48_OUT_SEL : R/W ;bitpos:[8:0] ;default: 9'h100 ; */
/*description: */
#define GPIO_FUNC48_OUT_SEL  0x000001FF
#define GPIO_FUNC48_OUT_SEL_M  ((GPIO_FUNC48_OUT_SEL_V)<<(GPIO_FUNC48_OUT_SEL_S))
#define GPIO_FUNC48_OUT_SEL_V  0x1FF
#define GPIO_FUNC48_OUT_SEL_S  0

#define GPIO_FUNC49_OUT_SEL_CFG_REG          (DR_REG_GPIO_BASE + 0x618)
/* GPIO_FUNC49_OEN_INV_SEL : R/W ;bitpos:[11] ;default: 1'h0 ; */
/*description: */
#define GPIO_FUNC49_OEN_INV_SEL  (BIT(11))
#define GPIO_FUNC49_OEN_INV_SEL_M  (BIT(11))
#define GPIO_FUNC49_OEN_INV_SEL_V  0x1
#define GPIO_FUNC49_OEN_INV_SEL_S  11
/* GPIO_FUNC49_OEN_SEL : R/W ;bitpos:[10] ;default: 1'h0 ; */
/*description: */
#define GPIO_FUNC49_OEN_SEL  (BIT(10))
#define GPIO_FUNC49_OEN_SEL_M  (BIT(10))
#define GPIO_FUNC49_OEN_SEL_V  0x1
#define GPIO_FUNC49_OEN_SEL_S  10
/* GPIO_FUNC49_OUT_INV_SEL : R/W ;bitpos:[9] ;default: 1'h0 ; */
/*description: */
#define GPIO_FUNC49_OUT_INV_SEL  (BIT(9))
#define GPIO_FUNC49_OUT_INV_SEL_M  (BIT(9))
#define GPIO_FUNC49_OUT_INV_SEL_V  0x1
#define GPIO_FUNC49_OUT_INV_SEL_S  9
/* GPIO_FUNC49_OUT_SEL : R/W ;bitpos:[8:0] ;default: 9'h100 ; */
/*description: */
#define GPIO_FUNC49_OUT_SEL  0x000001FF
#define GPIO_FUNC49_OUT_SEL_M  ((GPIO_FUNC49_OUT_SEL_V)<<(GPIO_FUNC49_OUT_SEL_S))
#define GPIO_FUNC49_OUT_SEL_V  0x1FF
#define GPIO_FUNC49_OUT_SEL_S  0

#define GPIO_FUNC50_OUT_SEL_CFG_REG          (DR_REG_GPIO_BASE + 0x61C)
/* GPIO_FUNC50_OEN_INV_SEL : R/W ;bitpos:[11] ;default: 1'h0 ; */
/*description: */
#define GPIO_FUNC50_OEN_INV_SEL  (BIT(11))
#define GPIO_FUNC50_OEN_INV_SEL_M  (BIT(11))
#define GPIO_FUNC50_OEN_INV_SEL_V  0x1
#define GPIO_FUNC50_OEN_INV_SEL_S  11
/* GPIO_FUNC50_OEN_SEL : R/W ;bitpos:[10] ;default: 1'h0 ; */
/*description: */
#define GPIO_FUNC50_OEN_SEL  (BIT(10))
#define GPIO_FUNC50_OEN_SEL_M  (BIT(10))
#define GPIO_FUNC50_OEN_SEL_V  0x1
#define GPIO_FUNC50_OEN_SEL_S  10
/* GPIO_FUNC50_OUT_INV_SEL : R/W ;bitpos:[9] ;default: 1'h0 ; */
/*description: */
#define GPIO_FUNC50_OUT_INV_SEL  (BIT(9))
#define GPIO_FUNC50_OUT_INV_SEL_M  (BIT(9))
#define GPIO_FUNC50_OUT_INV_SEL_V  0x1
#define GPIO_FUNC50_OUT_INV_SEL_S  9
/* GPIO_FUNC50_OUT_SEL : R/W ;bitpos:[8:0] ;default: 9'h100 ; */
/*description: */
#define GPIO_FUNC50_OUT_SEL  0x000001FF
#define GPIO_FUNC50_OUT_SEL_M  ((GPIO_FUNC50_OUT_SEL_V)<<(GPIO_FUNC50_OUT_SEL_S))
#define GPIO_FUNC50_OUT_SEL_V  0x1FF
#define GPIO_FUNC50_OUT_SEL_S  0

#define GPIO_FUNC51_OUT_SEL_CFG_REG          (DR_REG_GPIO_BASE + 0x620)
/* GPIO_FUNC51_OEN_INV_SEL : R/W ;bitpos:[11] ;default: 1'h0 ; */
/*description: */
#define GPIO_FUNC51_OEN_INV_SEL  (BIT(11))
#define GPIO_FUNC51_OEN_INV_SEL_M  (BIT(11))
#define GPIO_FUNC51_OEN_INV_SEL_V  0x1
#define GPIO_FUNC51_OEN_INV_SEL_S  11
/* GPIO_FUNC51_OEN_SEL : R/W ;bitpos:[10] ;default: 1'h0 ; */
/*description: */
#define GPIO_FUNC51_OEN_SEL  (BIT(10))
#define GPIO_FUNC51_OEN_SEL_M  (BIT(10))
#define GPIO_FUNC51_OEN_SEL_V  0x1
#define GPIO_FUNC51_OEN_SEL_S  10
/* GPIO_FUNC51_OUT_INV_SEL : R/W ;bitpos:[9] ;default: 1'h0 ; */
/*description: */
#define GPIO_FUNC51_OUT_INV_SEL  (BIT(9))
#define GPIO_FUNC51_OUT_INV_SEL_M  (BIT(9))
#define GPIO_FUNC51_OUT_INV_SEL_V  0x1
#define GPIO_FUNC51_OUT_INV_SEL_S  9
/* GPIO_FUNC51_OUT_SEL : R/W ;bitpos:[8:0] ;default: 9'h100 ; */
/*description: */
#define GPIO_FUNC51_OUT_SEL  0x000001FF
#define GPIO_FUNC51_OUT_SEL_M  ((GPIO_FUNC51_OUT_SEL_V)<<(GPIO_FUNC51_OUT_SEL_S))
#define GPIO_FUNC51_OUT_SEL_V  0x1FF
#define GPIO_FUNC51_OUT_SEL_S  0

