espressif/esp-idf/components/soc/soc/esp32s3/include/soc/gpio_reg.h
#define GPIO_FUNC52_OUT_SEL_CFG_REG          (DR_REG_GPIO_BASE + 0x624)
/* GPIO_FUNC52_OEN_INV_SEL : R/W ;bitpos:[11] ;default: 1'h0 ; */
/*description: */
#define GPIO_FUNC52_OEN_INV_SEL  (BIT(11))
#define GPIO_FUNC52_OEN_INV_SEL_M  (BIT(11))
#define GPIO_FUNC52_OEN_INV_SEL_V  0x1
#define GPIO_FUNC52_OEN_INV_SEL_S  11
/* GPIO_FUNC52_OEN_SEL : R/W ;bitpos:[10] ;default: 1'h0 ; */
/*description: */
#define GPIO_FUNC52_OEN_SEL  (BIT(10))
#define GPIO_FUNC52_OEN_SEL_M  (BIT(10))
#define GPIO_FUNC52_OEN_SEL_V  0x1
#define GPIO_FUNC52_OEN_SEL_S  10
/* GPIO_FUNC52_OUT_INV_SEL : R/W ;bitpos:[9] ;default: 1'h0 ; */
/*description: */
#define GPIO_FUNC52_OUT_INV_SEL  (BIT(9))
#define GPIO_FUNC52_OUT_INV_SEL_M  (BIT(9))
#define GPIO_FUNC52_OUT_INV_SEL_V  0x1
#define GPIO_FUNC52_OUT_INV_SEL_S  9
/* GPIO_FUNC52_OUT_SEL : R/W ;bitpos:[8:0] ;default: 9'h100 ; */
/*description: */
#define GPIO_FUNC52_OUT_SEL  0x000001FF
#define GPIO_FUNC52_OUT_SEL_M  ((GPIO_FUNC52_OUT_SEL_V)<<(GPIO_FUNC52_OUT_SEL_S))
#define GPIO_FUNC52_OUT_SEL_V  0x1FF
#define GPIO_FUNC52_OUT_SEL_S  0

#define GPIO_FUNC53_OUT_SEL_CFG_REG          (DR_REG_GPIO_BASE + 0x628)
/* GPIO_FUNC53_OEN_INV_SEL : R/W ;bitpos:[11] ;default: 1'h0 ; */
/*description: */
#define GPIO_FUNC53_OEN_INV_SEL  (BIT(11))
#define GPIO_FUNC53_OEN_INV_SEL_M  (BIT(11))
#define GPIO_FUNC53_OEN_INV_SEL_V  0x1
#define GPIO_FUNC53_OEN_INV_SEL_S  11
/* GPIO_FUNC53_OEN_SEL : R/W ;bitpos:[10] ;default: 1'h0 ; */
/*description: */
#define GPIO_FUNC53_OEN_SEL  (BIT(10))
#define GPIO_FUNC53_OEN_SEL_M  (BIT(10))
#define GPIO_FUNC53_OEN_SEL_V  0x1
#define GPIO_FUNC53_OEN_SEL_S  10
/* GPIO_FUNC53_OUT_INV_SEL : R/W ;bitpos:[9] ;default: 1'h0 ; */
/*description: */
#define GPIO_FUNC53_OUT_INV_SEL  (BIT(9))
#define GPIO_FUNC53_OUT_INV_SEL_M  (BIT(9))
#define GPIO_FUNC53_OUT_INV_SEL_V  0x1
#define GPIO_FUNC53_OUT_INV_SEL_S  9
/* GPIO_FUNC53_OUT_SEL : R/W ;bitpos:[8:0] ;default: 9'h100 ; */
/*description: */
#define GPIO_FUNC53_OUT_SEL  0x000001FF
#define GPIO_FUNC53_OUT_SEL_M  ((GPIO_FUNC53_OUT_SEL_V)<<(GPIO_FUNC53_OUT_SEL_S))
#define GPIO_FUNC53_OUT_SEL_V  0x1FF
#define GPIO_FUNC53_OUT_SEL_S  0

#define GPIO_CLOCK_GATE_REG          (DR_REG_GPIO_BASE + 0x62C)
/* GPIO_CLK_EN : R/W ;bitpos:[0] ;default: 1'b1 ; */
/*description: */
#define GPIO_CLK_EN  (BIT(0))
#define GPIO_CLK_EN_M  (BIT(0))
#define GPIO_CLK_EN_V  0x1
#define GPIO_CLK_EN_S  0

#define GPIO_DATE_REG          (DR_REG_GPIO_BASE + 0x6FC)
/* GPIO_DATE : R/W ;bitpos:[27:0] ;default: 28'h1907040 ; */
/*description: */
#define GPIO_DATE  0x0FFFFFFF
#define GPIO_DATE_M  ((GPIO_DATE_V)<<(GPIO_DATE_S))
#define GPIO_DATE_V  0xFFFFFFF
#define GPIO_DATE_S  0

#ifdef __cplusplus
}
#endif
